app/controllers/tasks_controller.rb

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    task = Task.new(
      action: params[:task][:action],
      description: params[:task][:description],
      completion_date: params[:task][:completion_date]
    )

    is_successful_save = task.save
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "test date"], ["description", "try if date shows up"], ["created_at", "2018-09-20 22:42:50.978692"], ["updated_at", "2018-09-20 22:42:50.978692"], ["completion_date", "0018-09-20"]]

  def edit
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
    @task.update(
      action: params[:task][:action],
      description: params[:task][:description],
      completion_date: params[:task][:completion_date]
    )
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-01"], ["updated_at", "2018-09-23 15:38:52.828541"], ["id", 6]]

  def destroy
    task_id = params[:id]
    @task = Task.find_by(id: task_id)

    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]

  def complete
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
    @task.update(completion_date: DateTime.now.strftime("%d/%m/%Y"))
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-21 22:27:05.958174"], ["id", 6]]